Repository: mozilla-l10n/mt-training-data
Catalog: su/su_pontoon.tmx
Source language: en_us
Languages: su

source: New Session
su: Rintakan Anyar

source: No (allow all cookies)
su: Ulah (idinan kuki)

source: Notifications let you erase your %1$s session with a tap. You don’t need to open the app or see what’s running in your browser.
su: Iber pikeun ngahapus rintakan %1$s anjeun sakali tap. Anjeun teu kudu muka appna atawa nempo naon anu keur jalan dina panyungsi anjeun.

source: Number of trackers blocked
su: Jumlah palacak nu dipeungpeuk

source: Oops
su: Euleuh

source: Open a link in a new tab Long-press any link on a page
su: Muka hiji tutumbu dina hiji tab anyar Pencét lila tutumbu dina kacana

source: Open every link in %1$s Set %1$s as default browser
su: Buka sakur tutumbu di %1$s Setél %1$s minangka panyungsi baku

source: Open link in another app
su: Buka tutumbu di aplikasi séjén

source: Open Link in New Session
su: Buka Tutumbu dina Rintakan Anyar

source: Open with app
su: Buka maké aplikasi

source: <p>%1$s puts you in control.</p> <p>Use it as a private browser: <ul> <li>Search and browse right in the app</li> <li>Block trackers (or update settings to allow trackers)</li> <li>Erase to delete cookies as well as search and browsing history</li> </ul> </p> <p>%1$s is produced by Mozilla. Our mission is to foster a healthy, open Internet.<br/> <a href="%2$s">Learn more</a></p>
su: <p>%1$s méré anjeun kadali.</p> <p>Paké pikeun panyungsi nyamuni: <ul> <li>Paluruh jeung sungsi langsung dina appna</li> <li>Peungpeuk palacak (atawa apdét setélan pikeun ngaheugbaékeun palacak)</li> <li>Pupus pikeun ngaleungitkeun kuki pon kitu ogé jujutan pamaluruhan jeung panyungsian</li> </ul> </p> <p>%1$s dijieun ku Mozilla. Misina nya éta pikeun ngamumulé Internét nembrak anu séhat.<br/> <a href="%2$s">Lenyepan</a></p>

source: Pages may load faster, but may also behave unexpectedly
su: Kaca meureun ngamuat leuwih gancang, ngan bisa waé teu katerka

source: Paste or enter URL
su: Terapkeun atawa asupkeun URL

source: Performance
su: Kinerja

source: Power up your privacy
su: Bedaskeun salindungan anjeun

source: Privacy & Security
su: Salindungan & Kaamanan

source: Rather see the full desktop site?%1$s Menu > Request desktop site
su: Leuwih resep nempo loka déstop weuteuh?%1$s Menu > Pilih loka déstop

source: Rather see the full desktop site? Menu > Request desktop site
su: Leuwih milih muka loka vérsi déstop? Menu > Mundut loka déstop

source: Remote debugging via USB/Wi-Fi
su: Debugging ti kajauhan liwat USB/Wi-Fi

source: Remove all websites
su: Piceun sakabéh raramatloka

source: Remove custom URLs
su: Piceun URL sakahayang

source: Removes ads designed to track site visits even if you don’t tap them
su: Singkahkeun iklan anu dirancang pikeun ngalacak sindangan loka sanajan anjeun teu ngatap

source: Remove search engines
su: Piceun mesin pamaluruh

source: Request desktop site
su: Pénta loka déstop

source: Restore default search engines
su: Pasang deui mesin pamaluruh baku

source: Return to your favorite sites in %1$s quickly. Just select "Add to Home screen" from the %1$s menu.
su: Sakocepat balik deui kana loka karesep anjeun %1$s . Pilih baé "Tambahkeun ka layar Tepas" tina menu %1$s.

source: Safe Browsing
su: Ngalanglang Aman

source: Saved and shared images <b>will not be deleted</b> when you erase %1$s history.
su: Gambar teundeunan jeung nu dibagikeun mah <b>moal dipupus</b> nalika anjeun mupus %1$s jujutan.

source: Search engine name
su: Ngaran mesin pamaluruh

source: Search for %1$s
su: Paluruh %1$s

source: Searching for something different? Choose another default search engine in Settings.
su: Néangan nu béda? Pilih mesin pamaluruhan baku séjénna di Setélan.

source: Search Privately
su: Pamaluruhan Nyamuni

source: Secure connection failed
su: Sambungan aman teu laksana

source: Security
su: Kaamanan

source: Server not found
su: Server teu kapanggih

source: Set %1$s as your default browser and get the benefits of private browsing when you open webpages from other apps.
su: Setél %1$s jadi panyungsi baku sarta cokot kauntungan langlangan nyalindung sawaktu anjeun muka kaca raramat ti aplikasi séjén.

source: Set default, autocomplete
su: Setél baku, otokumplit

source: Share…
su: Bagikeun…

source: Shortcut will open with Tracking Protection disabled
su: Takulan bakal ngabuka kalawan Kilung Palacak pareum

source: Show home screen tips
su: Témbongkeun weling layar tepas

source: Site behaving unexpectedly? Try turning off Tracking Protection
su: Lokana ngaco? Coba pareuman Salindung Palacak

source: Site Security
su: Kaamanan Loka

source: Some ads track site visits, even if you don’t click the ads
su: Sababaraha iklan ngalacak anjangan loka, najan anjeun teu ngaklik iklanna

source: Some search engines cannot show suggestions.
su: Sababaraha mesin panyungsi teu bisa némbongkeun saran.

source: Sorry. We’re having a problem with this tab.
su: Hampura. Aya masalah dina ieu tab.

source: Stealth
su: Nyiliwuri

source: Stops ads and other annoyances using block lists from Easylist, EasyPrivacy, Fanboy’s Annoyance, and 777Guard Mobile Ad Filter
su: Eureunan iklan jeung rereged lianna maké béréndélan peungpeuk ti Easylist, EasyPrivacy, Fanboy’s Annoyance, jeung 777Guard Mobile Ad Filter

source: Stops social-media related trackers embedded on websites, including social share buttons
su: Eureunan palacak anu tumali jeung média sosial anu dicantélkeun dina raramatloka, kaasup tombol babagi sosial

source: Switching Apps
su: Pindah Apps

source: Switch to link in new tab immediately
su: Geuwat gilir ka tutumbu di tab anyar

source: Tab Crashed
su: Tab Ruksak

source: Tab’s browsing history has been erased.
su: Jujutan langlangan tab geus dipupus.

source: Tabs open: %1$s
su: Tab muka: %1$s

source: Take private browsing to the next level. Block ads and other content that can track you across sites and bog down page load times.
su: Cokot langlangan nyalindung ka undakan saterusna. Peungpeuk iklan jeung kontén lianna nu bisa ngalacak anjeun di sakuliah loka sarta ngalaunan waktu muka kaca.

source: The connection timed out
su: Sambungan beak waktu

source: To get search suggestions, %1$s needs to send what you type in the address bar to the search engine you’ve chosen. %2$s.
su: Pikeun nampa saran sungsian, %1$s kudu ngirim naon anu diketikkeun dina bilah alamat kana mesin panyungsi pilihan anjeun. %2$s.

source: Touch the fingerprint sensor to continue.
su: Tapelkeun ka sénsor sidik ramo pikeun neruskeun.

source: Tracking, cookies, data choices
su: Palacakan, kuki, pilihan data

source: Trusted site? Allowlist disables Tracking Protection for sites you know and trust.
su: Loka kapercaya? Allowlist numpurkeun Salindung Palacak pikeun loka anu anjeun wanoh jeung percaya.

source: Turning this off may fix some site problems
su: Mareuman ieu bisa menerkeun sababaraha masalah loka

source: Turn off tips on the %1$s start screen
su: Pareuman weling dina %1$s layar mimiti

source: Turn off tips on the start screen
su: Pareuman tips dina layar mimiti

source: Turn off to fix some sites
su: Pareuman pikeun menerkeun sababaraha loka

source: <ul> <li>Check the address for typing errors such as <strong>ww</strong>.example.com instead of <strong>www</strong>.example.com</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
su: <ul> <li>Pariksa alamatna bisi aya salah ketik kawas <strong>ww</strong>.conto.com anu kuduna <strong>www</strong>.conto.com</li> <li>Lamun anjeun teu bisa ngamuat kaca hiji ogé, pariksa data ponsél atawa sambungan Wi-Fi anjeun.</li> </ul>

source: <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your mobile device’s data or Wi-Fi connection.</li> </ul>
su: <ul> <li>Loka sigana keur teu bisa dibuka atawa keur riweuh. Pecakan sakeudeung deui.</li> <li>Lamun teu bisa ngamuat hiji ogé, pariksa data ponsél atawa sambungan Wi-Fi anjeun.</li> </ul>

source: <ul> <li>This problem can sometimes be caused by disabling or refusing to accept cookies.</li> </ul>
su: <ul> <li>Ieu masalah sakapeung mah dilantarankeun ku dipareumanna atawa ditolakna kuki.</li> </ul>

source: <ul> <li>You might need to install other software to open this address.</li> </ul>
su: <ul> <li>Sigana anjeun kudu masang aplikasi séjén pikeun muka ieu alamat.</li> </ul>

source: URL already exists
su: URL geus aya

source: URL Autocomplete
su: URL Otokumplit

source: URL to add
su: URL tambahkeuneun

source: Used to collect, analyze and measure activities like tapping and scrolling
su: Dipaké pikeun ngumpulkeun, analisis, jeung ngukur ketak sarupaning tap jeung gorolong

source: Use fingerprint to unlock app
su: Paké sidik ramo pikeun muka konci app

source: Verified by: %1$s
su: Dipéripikasi ku: %1$s

source: Web Content
su: Eusi Raramat

source: We can’t load this page for some reason.
su: Kami teu sanggup ngaluarkeun ieu kaca kusabab sababaraha alesan.

source: Would you like to turn on search suggestions?
su: Arék ngahurungkeun saran sungsian?

source: You are not granted any rights or licenses to the trademarks of the Mozilla Foundation or any party, including the Mozilla, Firefox or %1$s names or logos. Additional information may be found <a href="%2$s">here</a>.
su: Anjeun teu dibéré idin atawa lisénsi nanaon kana mérek dagang Mozilla Foundation atawa pihak mana ogé, kaasup ngaran atawa logo Mozilla, Firefox, atawa %1$s. Inpormasi leuwih jero bisa dipanggihan <a href="%2$s">di dieu</a>.

source: You can leave %1$s to open this link in %2$s.
su: Anjeun bisa ninggalkeun %1$s pikeun muka ieu tutumbu di %2$s.

source: You have disabled Content Blocking for these websites.
su: Anjeun numpurkeun Peungpeuk Kontén pikeun ieu raramatloka.

source: Your browsing history has been erased.
su: Jujutan langlangan anjeun geus dipupus.

source: Your fingerprint can unlock %1$s if a URL is already opened in the app. Stealth will be turned on.
su: Sidik ramo anjeun bisa muka konci %1$s lamun aya URL nu geus dibuka dina appna. Nyiliwuri bakal dihurungkeun.

source: Add a script and you are halfway through
su: Tambaheun skrip sarta anjeun geus satengah leumpang

source: Are you a developer, interested in Pontoon? There are plenty of ways to get your hands dirty.
su: Anjeun saurang pamekar, kataji kana Pontoon? Réa cara pikeun ilubiung.

source: As soon as you are happy with your translation, you can save it by pressing Enter or clicking the save icon in the toolbar. To quit translation mode without saving changes, press Esc or click the cancel icon in the toolbar.
su: Saanggeus anjeun puas kana tarjamahan anjeun, anjeun bisa nyimpenna kalawan mencét Énter atawa nglik ikon simpen di leunjeuran parabot. Pikeun kaluar tina modeu tarjamahan tanpa neundeun gagantina, pencét Esc atawa klik ikon bolay na leunjeuran parabot.

source: a text block
su: blok téks

source: A toolbar appears above the dashed rectangle, allowing you to select the corresponding text block for editing. To do so, either click on the Edit button in the toolbar, or double-click anywhere inside the dashed border.
su: Leunjeuran parabot bijil di luhureun pasagi panjang pepegatan, ngamumkinkeun anjeun pikeun milih blok téks tinangtu jang éditeun. Pikeun ngalampahanna, klik tumbul Édit di leunjeurat parabot, atawa klik dua kali di mana wé na jero garis pepegatan.

source: Avoid breaking user interface by seeing how much space is available for your translations, which is especially useful with apps.
su: Singkahan ngaruksak antarbeungeut ku cara nitétan lega henteuna rohang nu sayaga pikeun tarjamahan anjeun, nu utamana mah mangpaat kana aplikasi.

source: By localizing web page on the page itself, you no longer need to worry if the word you are translating is a verb or noun.
su: Ku narjamahkeun kaca wéb langsung di éta kacana sorangan, anjeun kudu deui melang dina ngabédakeun kecap pagawéan jeung kecap barang.

source: By someone you trust
su: Ku pihak nu anjeun percaya

source: Crafted by Mozilla
su: Dijieun ku Mozilla

source: Developed by the non-profit behind Firefox
su: Dimekarkeun ku tanpabati di satukangeun Firefox

source: Developers
su: Pamekar

source: Enable it on your site
su: Hurunkeun ieu kana loka anjeun

source: Get help from translation memory, machine translation and the likes
su: Siar pitulung tina mémori alihbasa, alihbasa mesin, jeung sabangsana

source: Get instant preview
su: Pramidang instan

source: Get involved
su: Hayu milakon

source: Hack it on GitHub
su: Oprékan di GitHub

source: Hover
su: Koléangkeun

source: How
su: Kumaha

source: How does it work?
su: Kumaha cara digawéna?

source: In place.
su: Langsung di dieu.

source: It's completely free and open source
su: Asli bébas sarta sumber nembrak

source: Join us
su: Hayu aub

source: Localize the web.
su: Palokalan wéb.

source: Move your mouse over headings, links, paragraphs or other text blocks on this page. A dashed rectangle will appear around each of these blocks, marking strings that are available for localization on the page itself.
su: Obahkeun beubeuritan anjeun di luhureun jejer, tutumbu, paragraf, atawa blok téks lianna di ieu kaca. Kotak pepegatan bakal bijil di sabudeureun blok téks, nandaan string nu bisa dilokalisasi pikeun éta kaca.

source: over web content
su: di luhureun kontén wéb

source: Plurals support
su: Pangrojong wangun jama'

source: Pontoon allows you to localize web content in place, with context and spatial limitations right in front of you.
su: Pontoon ngombéran ka anjeun pikeun narjamahkeun eusi raramat sacara langsung, luyu jeung watesan hak kontéks jeung spasial anjeun.

source: Pontoon by Mozilla
su: Pontoon ku Mozilla

source: Pontoon is a very simple and intuitive tool that requires little to no technical skill for localizers to use.
su: Pontoon téh parabot nu basajan sarta intuitif nu merlukeunna ngan saeutik pangabisa jang ngagunakeunna ku para palokal.

source: Pontoon's in place translation mode is what puts it above others, but it also has many other benefits.
su: Modeu panarjamahan langsung milik Pontoon ieu téh nu ngajadikeunna di saluhureun nu séjén, lian ti kitu loba kaonjoyan lianna.

source: Quality checks
su: Pariksa mutu

source: See spatial limitations
su: Titénan kawatesna rohang

source: selected text
su: téks nu dipilih

source: Strings with plurals can be translated to all plural forms available in your languge
su: String wangun jama' bisa ditarjamahkeun ka sakur wangun jama' nu nyangkaruk pikeun basa Anjeun

source: Tell Me More
su: Émbaran salengkepna

source: The moment you submit translation, it replaces the original text in the web page, making you the first proofreader and tester.
su: Nalika anjeun ngirim ieu tarjamahan, ieu téh ngagantikeun téks asli di kaca wébna, ngajadikeun anjeun minangka panguji sarta pangoréksi munggaran.

source: Translate
su: Tarjamahkeun

source: Translation helpers
su: Panulung panarjamahan

source: Translations are automatically reviewed for quality before saving
su: Alihbasa sacara otomatis dilenyepan mutuna saméméh neundeun

source: Understand context
su: Cangkem kontéks

source: What
su: Naon

source: What else can it do?
su: Naon déui nu bisa dipilampah?

source: What is Pontoon?
su: Naon ari Pontoon?

source: When you enter editing mode, the entire text block will be selected. You can start typing your translation immediately while seeing the exact context of your source string and how much space is available for your translation.
su: Basa anjeun asup kana modeu édit, sakumna blok téks bakal kapilih. Anjeun bisa langsung ngetik tarjamahan anjeun bari ngilikan kontéks téks aslina jeung sabaraha loba rohang nu sayaga pikeun tarjamahan anjeun.

source: your translation
su: tarjamahan anjeun

source: All My Questions
su: Sakabéh Patakonan Kami

source: Already registered? Sign in
su: Geus daptar? Asup

source: An account lets you answer questions, track contributions and receive alerts.
su: Lamun boga akun, anjeun bisa ngajawab patakonan, nyusud kontribusi, jeung nampa iber.

source: Another helper has answered this question, please choose another.
su: Geus aya nu ngajawab patakonan ieu, mangga pilih nu lianna.

source: Answer a Question
su: Jawab Patakonan

source: Answered Questions
su: Patakonan Kajawab

source: Answer questions
su: Jawab patakonan

source: Answer Questions
su: Jawab Patakonan

source: Archive this question
su: Arsipkeun ieu patakonan

source: Ask a Question
su: Takon

source: Ask a Question about Marketplace
su: Nyieun Patakonan ngeunaan Marketplace

source: BuddyUp currently doesn't support "<span id="language"></span>".
su: BuddyUp kiwari can ngadukung "<span id="language"></span>".

source: Cancel Sign Up
su: Bolaykeun Daptar

source: Click on the link in your email to let us know that it made it to the right place. After that, return to BuddyUp and make other users happy!
su: Klik tutumbu dina surél pikeun ngiberan yén geus tepi. Geus kitu, balik ka BuddyUp sarta senangkeun pamaké lianna!

source: Confirm Account
su: Sahkeun Akun

source: Create Account
su: Jieun Akun

source: Create account or sign in
su: Jieun akun atawa asup

source: Delete Answer | {t} | Firefox Support Forum
su: Hapus Jawaban | {t} | Forum Pangdeudeul Firefox

source: Delete question
su: Hapus patakonan

source: Delete Question | {t} | Firefox Support Forum
su: Hapus Patakonan | {t} | Forum Pangdeudeul Firefox

source: Delete this question
su: Hapus ieu patakonan

source: <div {countattr}>{n}</div><div {textattr}> question solved</div>
su: <div {countattr}>{n}</div><div {textattr}> patakonan geus kajawab</div>

source: Don't have an account? Register
su: Teu boga akun? Daptar

source: Edit a Question
su: Ropéa Patakonan

source: Edit the question
su: Ropéa patakonanana

source: Edit the question.
su: Ropéa patakonanana.

source: Edit this question
su: Ropéa ieu patakonan

source: Email Address
su: Alamat Surél

source: Forgot your password?
su: Poho kecap sandi?

source: Get a Buddy to help you with your device
su: Téang Buddy nu bisa mantuan ngoprék parabot anjeun

source: Go back to the question.
su: Balik deui ka patakonan.

source: Go back to the question and try again.
su: Balik ka patakonan jeung cobaan deui.

source: Has your question been solved?
su: Patakonan anjeun geus kajawab?

source: Have Answers?
su: Boga Jawaban?

source: Have Questions?
su: Boga Patakonan?

source: Help Article
su: Artikel Pitulung

source: Help other users around the world
su: Tulungan pamaké séjén di sakuliah dunya

source: If you need help with Firefox, please <a href="%(aaq_url)s">ask a question</a>.
su: Bisi anjeun butuh pitulung ngeunaan Firefox, mangga <a href="%(aaq_url)s">kirim patakonan</a>.

source: Incompatible version
su: Vérsi teu saluyu

source: Lock this question
su: Konci ieu patakonan

source: My preferences
su: Préferénsi kami

source: My Profile
su: Profil Kami

source: My Question
su: Patakonan Kami

source: My Questions
su: Patakonan Kami

source: New answers for question: %s
su: Jawaban anyar pikeun patakonan: %s

source: No active questions
su: Euweuh patakonan anu aktip

source: No questions
su: Euweuh patakonan

source: {n} question solved
su: {n} patakonan kajawab

source: Ok
su: Heug

source: Please ask your questions in English, or go to <a href="http://support.mozilla.org">http://support.mozilla.org</a> for more help.
su: Mangga tatanya dina Basa Inggris, atawa buka <a href="http://support.mozilla.org">http://support.mozilla.org</a> pikeun pitulung leuwih lengkep.

source: Post Question
su: Kirim Patakonan

source: Question
su: Patakonan

source: Question:
su: Patakonan:

source: Questions
su: Patakonan

source: Questions responded to within X hours
su: Patakonan anu dipairan dina X jam

source: Questions solved
su: Patakonan geus kajawab

source: Save Question
su: Teundeun Patakonan

source: Sending…
su: Ngirim…

source: Sign in to answer questions from Firefox OS users.
su: Asup pikeun ngajawab patakonan ti pamaké OS Firefox.

source: Sign in to answer questions from the Mozilla community.
su: Asup pikeun ngajawab patakonan ti komunitas Mozilla.

source: Solution ✓
su: Solusi ✓

source: %s posted an answer to your question "%s"
su: %s mairan kana patakonan anjeun "%s"

source: Stop receiving updates via email for this question.
su: Eureunan nampa iber anyar ngaliwatan surél ngeunaan ieu patakonan.

source: Summarize your question in a sentence
su: Tingkes patakonan anjeun dina hiji kalimah

source: Thank you for your question!
su: Nuhun kana patakonanana!

source: There was a problem with Buddy Up, please try again.
su: Aya masalah dina Buddy Up, mangga cobaan deui.

source: This question already has a solution.
su: Ieu patakonan geus aya jawabna.

source: This solved my question
su: Ieu ngajawab patakonan kami

source: This will close the question and let your buddy know you no longer need help.
su: Ieu bakal nutup patakonanana sarta ngiberan batur yén anjeun geus teu kudu dibantuan.

source: Too many questions? Use the settings below to narrow down the "Answer a Question" list.
su: Loba teuing patalekan? Paké setélan di handap pikeun ngaheureutan béréndélan "Jawab Patalekan".

source: Top Helpers this Week
su: Loba Tutulung Saminggu Ieu

source: Unlock this question
su: Buka konci ieu patakonan

source: Unsupported Language
su: Basa Teu Didukung

source: {user} left a comment on your question
su: {user} mairan kana patakonan anjeun

source: We've sent a welcome email to:
su: Surél pangbagéa geus dikirim ka:

source: Whoops!
su: Euleuh!

source: x hours ago
su: x jam kaliwat

source: Yay, you're almost done!
su: Cihuy, saeutik deui réngsé!

source: You are not online, please check your connection.
su: Anjeun teu onlén, mangga pariksa sambunganana.

source: abnormality
su: mahiwal

source: add-on
su: émboh

source: aggregate
su: agrégat

source: alternate text
su: téks alternatip

source: appear
su: némbongan

source: appearance
su: pidangan

source: attack
su: narajang

source: attacker
su: anu narajang

source: attendee
su: pamiarsa

source: authenticate
su: oténtikasi

source: authenticated
su: geus dioténtikasi

source: back out
su: bedo

source: black box
su: kotak hideung

source: bookmark
su: markah

source: boot
su: talapung

source: Bug report
su: Laporan bug

source: certificate authority
su: otoritas sértipikat

source: channel
su: kanal

source: clipboard
su: papan klip

source: clockwise
su: saarah jarum jam

source: compact
su: ringkes

source: context
su: kontéks

source: contribute
su: nyumbang

source: corrupt
su: ruksak

source: corrupted
su: ruksak

source: counterclockwise
su: sabalikna arah jarum jam

source: deceptive site
su: loka titipu

source: decryption
su: dekripsi

source: disinformation
su: disinformasi

source: encrypt
su: énkrip

source: encryption
su: énkripsi

source: home page
su: tepas

source: import
su: impor

source: insecure
su: teu aman

source: installation
su: pamasangan

source: Issue
su: Masalah

source: native
su: pituin

source: open source
su: sumber nembrak

source: override
su: timpah

source: preference
su: préperénsi

source: release
su: rilis

source: report
su: laporan

source: revert
su: balikkeun

source: security keys
su: konci kaamanan

source: track
su: lacak

source: trackers
su: palacak

source: version
su: pérsi

source: Web Authentication
su: Oténtikasi Raramat

source: Continue with this browser
su: Tuluykeun ku ieu panyungsi

source: Copied!
su: Ditiron!

source: Copy the link to open in another browser
su: Tiron tutumbu jang bukaeun di panyungsi séjén

source: Copy the link to share your file:
su: Tiron tutumbu pikeun babagi koropak anjeun:

source: Create a { -firefox } Account or sign in
su: Jieun akun { -firefox } atawa asup

source: { $days }d { $hours }h { $minutes }m
su: { $days }p { $hours }j { $minutes }m

source: Decrypting…
su: Ngadékripsi...

source: Download complete
su: Undeuran anggeus
